<?php
function br(){
echo nl2br("\n"); //<br />タグが挿入される。
}

// クエリの取得と表示
echo "入力された値：".$_GET['n'];
br();
br();

// 2,3,5,7の素数がそれぞれ何回登場したかを格納する変数
$n2 = 0;
$n3 = 0;
$n5 = 0;
$n7 = 0;

// クエリを変数に格納
$num = $_GET['n'];

while($num%2==0) {
    $num = $num / 2;
    $n2 += 1;
}
while($num%3==0) {
    $num = $num / 3;
    $n3 += 1;
}
while($num%5==0) {
    $num = $num / 5;
    $n5 += 1;
}
while($num%7==0) {
    $num = $num / 7;
    $n7 += 1;
}
echo "素数は";
$mes = "";

// 素数を何回かけるのかを数えるために格納させる変数
$n2_1 = "";
$n3_1 = "";
$n5_1 = "";
$n7_1 = "";

// 入力された数字に２の素数があれば
if ($n2 >= 1) {
    $mes = $mes . 2 . ",";
    // 素数２を何回かけるかを格納する
    for ($i=1;$i<=$n2;$i++) {
        if ($i==1) {
            $n2_1 = 2;
        }elseif ($i>=1) {
            $n2_1 = $n2_1 . "*" . 2;
        }
    }
}
// 入力された数字に３の素数があれば
if ($n3 >= 1) {
    $mes = $mes . 3 . ",";
    // 素数３を何回かけるかを格納する
    for ($j=1;$j<=$n3;$j++) {
        if ($j==1) {
            $n3_1 = 3;
        }elseif ($j>=1) {
            $n3_1 = $n3_1 . "*" . 3;
        }
    }
}

// 入力された数字に５の素数があれば
if ($n5 >= 1) {
    $mes = $mes . 2 . ",";
    // 素数５を何回かけるかを格納する
    for ($i=1;$i<=$n5;$i++) {
        if ($i==1) {
            $n5_1 = 5;
        }elseif ($i>=1) {
            $n5_1 = $n5_1 . "*" . 5;
        }
    }
}
// 入力された数字に７の素数があれば
if ($n7 >= 1) {
    $mes = $mes . 2 . ",";
    // 素数７を何回かけるかを格納する
    for ($i=1;$i<=$n7;$i++) {
        if ($i==1) {
            $n7_1 = 7;
        }elseif ($i>=1) {
            $n7_1 = $n7_1 . "*" . 7;
        }
    }
}
echo $mes;

// 素数２，３，５，７以外を含む場合
// $numはいま1になってるためそれも省く（最初の条件）！
if (($num!=1) and ($num%2!=0) and ($num%3!=0) and ($num%5!=0) and ($num%7!=0)) {
    echo "その他";
}

br();
br();

// 一桁の素数しかなかった場合、計算式を表示してあげる
if (($n2 != 0) || ($n3 != 0) || ($n5 != 0) || ($n7 != 0)) {
    //＊三項演算子のかっこを忘れないようにする＊
    echo $_GET['n'] . "=" . $num . ($n2>0 ? "*": "") . $n2_1 . ($n3>0 ? "*": "") .  $n3_1  . ($n5>0 ? "*": "") . $n5_1 . ($n7>0 ? "*": "") . $n7_1;
}
